def min_distance(d1, d2, d3):
    # Рассчитаем длины всех возможных маршрутов:
    route_1 = d1 + d3 + d2  # Дом -> Магазин 1 -> Магазин 2 -> Дом
    route_2 = 2 * (d1 + d2)  # Дом -> Магазин 1 -> Дом -> Магазин 2 -> Дом
    route_3 = 2 * (d1 + d3)  # Дом -> Магазин 1 -> Магазин 2 -> Магазин 1 -> Дом
    route_4 = 2 * (d2 + d3)  # Дом -> Магазин 2 -> Магазин 1 -> Магазин 2 -> Дом

    # Возвращаем минимальную длину маршрута:
    return min(route_1, route_2, route_3, route_4)


# Ввод данных
d1 = int(input())
d2 = int(input())
d3 = int(input())

# Вывод результата
print(min_distance(d1, d2, d3))
