from datetime import datetime

data = {'Дима': ('03.11.2021 09:31:18', '03.11.2021 11:41:28'),
        'Геор': ('01.11.2021 09:03:04', '01.11.2021 12:40:35'),
        'Анна': ('02.11.2021 04:41:54', '02.11.2021 05:39:40'),
        'Илина': ('02.11.2021 01:36:40', '02.11.2021 04:48:27'),
        'Герман': ('04.11.2021 07:51:19', '04.11.2021 09:53:53'),
        'Руслан': ('01.11.2021 11:26:06', '01.11.2021 12:56:24'),
        'Лера': ('03.11.2021 11:09:41', '03.11.2021 14:37:41'),
        'Егор': ('03.11.2021 05:29:38', '03.11.2021 06:01:59'),
        'Максим': ('05.11.2021 13:05:03', '05.11.2021 14:27:41'),
        'Саша': ('03.11.2021 04:14:26', '03.11.2021 05:10:58'),
        'Марина': ('05.11.2021 15:21:06', '05.11.2021 18:33:46')}

# Для хранения времени решения каждого ученика
time_durations = {}

# Проход по словарю ключ-значение
for name, times in data.items():
    # Обработка времени начала и конца
    # times - кортеж из 2 строк
    # Индекс 0 извлекает первую строку (время начала): '03.11.2021 09:31:18'
    # Индекс 1 извлекает вторую строку (время окончания): '03.11.2021 11:41:28'
    start_time = datetime.strptime(times[0], '%d.%m.%Y %H:%M:%S')
    end_time = datetime.strptime(times[1], '%d.%m.%Y %H:%M:%S')

 # Вычисляем длительность (разность)
    duration = (end_time - start_time).total_seconds()
    time_durations[name] = duration

# Находим ученика с минимальным временем
fastest_student = min(time_durations, key=time_durations.get)
print(f"Самый быстрый ученик: {fastest_student}")